Repository: adslbarxatov/OSMacrosExecutor
Catalog: src/OSMacrosExecutor_*.resx
Languages: ru_ru

# AddDragBeginningText
source: &Begin dragging
ru_ru: &Начать перетаскивание

# AddDragEndingText
source: &End dragging
ru_ru: &Завершить перетаскивание

# AddFileExecutionText
source: E&xecute
ru_ru: &Выполнить

# AddKeyPressText
source: Press &keys combination
ru_ru: Нажать комибнацию &клавиш

# AddLeftClickText
source: &Left mouse click
ru_ru: &Левый щелчок мыши

# AddMousePointerText
source: Set mouse pointer &position
ru_ru: Задать позицию &указателя

# AddPauseText
source: Pa&use execution
ru_ru: При&остановить выполнение

# AddRightClickText
source: &Right mouse click
ru_ru: &Правый щелчок мыши

# BeginCycleText
source: &Cycle
ru_ru: &Цикл

# BeginMacro
source: During execution using of keyboard or mouse is not recommended. Begin macro?
ru_ru: Во время выполнения использование клавиатуры и мыши не рекомендуется. Запустить макрос?

# CommandsListLabelText
source: Commands list:
ru_ru: Список команд:

# CycleLabelText
source: times
ru_ru: раз

# EndCycleText
source: E&nd cycle
ru_ru: Завер&шить цикл

# ExDialogTitle
source: Select macro for execution
ru_ru: Выберите макрос для выполнения

# ExecutionGroupText
source: Execute file / command
ru_ru: Выполнить файл / команду

# ExecutionIsUnavailable
source: (execution module) is missing. Execution is unavailable
ru_ru: (модуль-исполнитель) отсутствует. Выполнение недоступно

# FDialogFilter
source: All files|*.*
ru_ru: Все файлы|*.*

# FDialogTitle
source: Select file for execution
ru_ru: Выберите файл для выполнения

# HelpText
source: Application may be used for imitation of user activities when: • you need to perform many similar operations with files and/or programs; • you cannot automate these activities using standard tools; • some activities must be performed without your direct participation. Application can 'use' mouse, keyboard, command line and interrupts as same as user with the same potentialities
ru_ru: Приложение может быть использовано для имитации действий пользователя, когда: • необходимо выполнить множество одинаковых операций с файлами и/или программами; • невозможно автоматизировать эти действия с помощью стандартных инструментов; • некоторые действия требуется выполнить без участия пользователя. Утилита может «использовать» мышь, клавиатуру, командную строку и паузы так же, как и пользователь, с теми же возможностями

# KeyboardGroupText
source: Keyboard
ru_ru: Клавиатура

# KeyReceiverText
source: Stay here and press combination
ru_ru: Кликните и нажмите комбинацию

# macrofile
source: Operating system macro file
ru_ru: Файл макроса операционной системы

# MExecuteText
source: &Execute macro; repeats:
ru_ru: &Выполнить макрос; повторов:

# MFileText
source: &File
ru_ru: &Файл

# MilliLabelText
source: milliseconds
ru_ru: миллисекунд

# MOpenText
source: &Open macro...
ru_ru: &Открыть макрос...

# MousePointerGroupText
source: Mouse pointer
ru_ru: Указатель мыши

# MQuitText
source: &Quit
ru_ru: В&ыход

# MRegisterText
source: &Register file association
ru_ru: За&регистрировать сопоставление файлов

# MSaveText
source: &Save macro...
ru_ru: &Сохранить макрос...

source: (no modifiers)
ru_ru: (без модификаторов)

# OFDialogFilter
source: OS macro file (*.{0:S})|*.{0:S}
ru_ru: Файл макроса операционной системы (*.{0:S})|*.{0:S}

# OFDialogTitle
source: Select macro for editing
ru_ru: Выберите макрос для редактирования

# OpenExistingFile
source: Do you want to open existing file? All unsaved data will be lost!
ru_ru: Открыть существующий файл? Все несохранённые данные будут утеряны!

# PauseGroupText
source: Pause
ru_ru: Пауза

# QuitApplication
source: Do you want to quit application? All unsaved data will be lost!
ru_ru: Завершить работу с приложением? Все несохранённые данные будут утеряны!

# SetMousePointerText
source: Select...
ru_ru: Задать...

# SFDialogTitle
source: Select new macro's placement
ru_ru: Укажите расположение нового макроса

# ShowVideo
source: Do you want to view user videoguide on our YouTube channel?
ru_ru: Показать видеоруководство пользователя на нашем YouTube-канале?

# WaitForFinishText
source: Wait for completion
ru_ru: Ждать завершения

source: Win key
ru_ru: Клавиша Win
